module.exports = {
    task1: {
        name: 'task1',
        time: 'Дни недели',
        day7: 'ВС',
        timeStart: '01:00:00',
        timeEnd: '23:00:00',
        action1: 'Резервное копирование базы данных'
    },
    task2: {
        name: 'task2',
        time: 'Дата',
        date: '2023-01-01',
        timeStart: '01:00:00',
        timeEnd: '23:00:00',
        action1: 'Команда в устройство',
        action2: 'Резервное копирование базы данных',
        command: 'ИУ: Поставить на охрану'
    },
    task3: {
        name: 'task3',
        time: 'День месяца',
        day: '10',
        timeStart: '01:00:00',
        timeEnd: '23:00:00',
        action1: 'Выполнить перерасчет Журнала рабочего времени',
        action2: 'Команда в устройство',
        command: 'ИУ: Поставить на охрану',
        action3: 'Резервное копирование базы данных',
        actionData3: 'вторая половина предыдущего месяца',
    },
    defaultValue: 'Резервное копирование базы данных'
};